/** GM 音色名称表（1-128 对应 0-127）。 */
export const GM_PROGRAM_NAMES: string[] = [
  '原声钢琴', '明亮钢琴', '电钢琴', '酒馆钢琴', ' Rhodes 电钢琴', '合唱电钢琴', '拨弦键琴', '击弦键琴',
  '钢片琴', ' celesta', '八音盒', '颤音琴', '马林巴', '木琴', '管钟', '扬琴',
  ' Hammond 风琴', '击杆风琴', '摇滚风琴', '教堂管风琴', '簧管风琴', '手风琴', '口琴', '探戈手风琴',
  '尼龙弦吉他', '钢弦吉他', '爵士电吉他', '清音电吉他', '闷音电吉他', '过载吉他', '失真吉他', '吉他和声',
  '原声贝斯', '指弹电贝斯', '拨片电贝斯', '无品贝斯', '拍弦贝斯', '手弹贝斯', '合成贝斯1', '合成贝斯2',
  '小提琴', '中提琴', '大提琴', '低音提琴', '弦乐震音', '弦乐拨奏', '管弦乐竖琴', '定音鼓',
  '弦乐合奏1', '弦乐合奏2', '合成弦乐1', '合成弦乐2', '合唱人声', '人声"嘟"', '金属铜管', '呼吸铜管',
  '小号', '长号', '大号', '弱音小号', '法国号', '铜管合奏', '合成铜管1', '合成铜管2',
  '高音萨克斯', '中音萨克斯', '次中音萨克斯', '低音萨克斯', '双簧管', '英国管', '巴松', '单簧管',
  '短笛', '长笛', '竖笛', '排箫', '吹瓶声', '口哨', '奥卡利那笛', '海笛',
  '方波lead', '锯齿波lead', '模拟lead', '数字lead', '良好lead', '低音lead', ' frost', '声音lead',
  '新世纪垫', '温暖垫', '复音垫', '合唱垫', '玻璃垫', '金属垫', '光环垫', '风声垫',
  '雨声', '音轨', '海边', '鸟鸣', '电话铃', '直升机', '掌声', '枪声',
];
